In [68]:
from pandas import DataFrame, Series
import pandas as pd
import numpy as np

In [2]:
!cat data/ex1.csv

'cat'은(는) 내부 또는 외부 명령, 실행할 수 있는 프로그램, 또는
배치 파일이 아닙니다.

In [3]:
df = pd.read_csv('data/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
df1 = pd.read_csv('data/ex2.csv')
df1

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [5]:
df1 = pd.read_csv('data/ex2.csv', header = None)
df1

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [6]:
df2 = pd.read_csv('data/ex2.csv', header = None, names = ['a', 'b', 'c', 'd', 'message'])
df2

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [7]:
df3 = pd.read_csv('data/ex2.csv', header = None, names = ['a', 'b', 'c', 'd', 'message'], index_col = 'message')
df3

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

 <br>
 ___

In [8]:
parsed = pd.read_csv('data/csv_mindex.csv', index_col = ['key1', 'key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

 <br>
___

In [9]:
list(open('data/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [10]:
result = pd.read_table('data/ex3.txt', sep = '\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [14]:
pd.read_csv('data/ex4.csv')

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [15]:
pd.read_csv('data/ex4.csv', skiprows = [0,2,3], index_col = 'message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [16]:
result = pd.read_csv('data/ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [21]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

 <br>
___

In [25]:
result = pd.read_csv('data/ex6.csv')
result[0:10]

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q
5  1.817480  0.742273  0.419395 -2.251035   Q
6 -0.776764  0.935518 -0.332872 -1.875641   U
7 -0.913135  1.530624 -0.572657  0.477252   K
8  0.358480 -0.497572 -0.367016  0.507702   S
9 -1.740877 -1.160417 -1.637830  2.172201   G

In [27]:
result1 = pd.read_csv('data/ex6.csv', nrows =5)
result1

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [50]:
chunker = pd.read_csv('data/ex6.csv', chunksize = 1000)
chunker

tat = Series([])
for i in chunker:
    tat=tat.add(i['key'].value_counts(), fill_value = 0)
tat = tat.sort_values(ascending=False)
tat[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

 <br>
 ___

In [51]:
data = pd.read_csv('data/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [52]:
data.to_csv('data/out.csv')
pd.read_csv('data/out.csv')

   Unnamed: 0 something  a   b     c   d message
0           0       one  1   2   3.0   4     NaN
1           1       two  5   6   NaN   8   world
2           2     three  9  10  11.0  12     foo

In [56]:
data.to_csv('data/out.csv', index = False, header = False)
pd.read_csv('data/out.csv', header = None)

       0  1   2     3   4      5
0    one  1   2   3.0   4    NaN
1    two  5   6   NaN   8  world
2  three  9  10  11.0  12    foo

In [57]:
import sys

In [58]:
data.to_csv(sys.stdout, index = False)

something,a,b,c,d,message
one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

 <br>
 ___

In [59]:
pd.read_csv('data/ex7.csv')

   a  b  c
0  1  2  3
1  1  2  3

 <br>
 ___
>JSON

In [63]:
obj = """
{"name": "Wes",
"place_lived": ["US", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 25, "pet": "Zuko"},
            {"name": "Katie", "age": 33, "pet": "Cisco"}]
            }
            """

In [64]:
import json

In [65]:
result = json.loads(obj)
result

{'name': 'Wes',
 'pet': None,
 'place_lived': ['US', 'Spain', 'Germany'],
 'siblings': [{'age': 25, 'name': 'Scott', 'pet': 'Zuko'},
  {'age': 33, 'name': 'Katie', 'pet': 'Cisco'}]}

In [67]:
sibling = pd.DataFrame(result['siblings'], columns = ['name', 'age'])
sibling

    name  age
0  Scott   25
1  Katie   33

 <br>
 ___